CSI API ETABS v1
cPointObj.GetCoordCylindrical Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCoordCylindrical(
	string Name,
	ref double R,
	ref double Theta,
	ref double Z,
	string CSys = "Global"
)
Function GetCoordCylindrical (
	Name As String,
	ByRef R As Double,
	ByRef Theta As Double,
	ByRef Z As Double,
	Optional CSys As String = "Global"
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim R As Double
Dim Theta As Double
Dim Z As Double
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.GetCoordCylindrical(Name,
	R, Theta, Z, CSys)
int GetCoordCylindrical(
	String^ Name,
	double% R,
	double% Theta,
	double% Z,
	String^ CSys = L"Global"
)
abstract GetCoordCylindrical :
        Name : string *
        R : float byref *
        Theta : float byref *
        Z : float byref *
        ?CSys : string
(* Defaults:
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
Name
Type: System.String
R
Type: System.Double
Theta
Type: System.Double
Z
Type: System.Double
CSys (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace